using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace MyWebProject.Infrastructure.Migrations
{
    public partial class addentity : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "facts",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Description = table.Column<string>(type: "nvarchar(max)", maxLength: 5000, nullable: false),
                    CategoryId = table.Column<int>(type: "int", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_facts", x => x.Id);
                });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "630d5dda-7255-4ce9-a658-0eedfb698a5f",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "74fdea27-fc31-4a96-9342-b86005ddc669", "AQAAAAEAACcQAAAAEBvXf8PBScOgadvSha2EnhYNuav74EGR9aXPEdOFLezfqare+9tnEVMNdbU87fC3bg==", "b5c27ff9-33f6-4e27-a808-1b02c94ffd2b" });

            migrationBuilder.InsertData(
                table: "Categories",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 7, "BulgarianFacts" },
                    { 8, "PeopleFacts" }
                });

            migrationBuilder.InsertData(
                table: "facts",
                columns: new[] { "Id", "CategoryId", "Description" },
                values: new object[,]
                {
                    { 1, 7, "Една от най-старите държави в Европа България е една от най-старите държави в Европа. Тя е и единствената държава, която никога не е променяла името си от създаването си през 681г." },
                    { 2, 7, "Пловдив – Един от най-старите постоянно населени градове в Европа и светаПловдив, вторият по големина град в България, е един от най-старите постоянно населени градове в Европа и света. В различните класации той заема от 1-во до 3-то място, затова тук не е посочено на кое място е. През по-голямата част от своята 8000-годишна история той е бил известен като Филипополис. Пловдив има археологически останки, които показват, че хората са се заселили в района повече от 8000 години. За сравнение, Рим е млад приблизително 2800 години, а Атина е създадена преди 6000 години." },
                    { 3, 7, "Най-старото златно съкровище Във Варна е открито най-старото златно съкровище в света. През 1972г. в некропол в индустриалната зона на черноморската столица на България са открити почти 300 гроба. Артефактите са от 4600 – 4200г. пр. н. е.! Съкровището се състои от общо 3000 предмета и тежи шест килограма." },
                    { 4, 7, " Най-старата православна църква е българската\r\nВ България е най–старата славянска православна църква. Тя е призната за независима църква през 870 г. сл. н. е." },
                    { 5, 7, "19 февруари – Денят на Освобождението на БългарияЗа първи път освобождението е чествано на 19 февруари (3 март нов стил) 1879г. във Велико търново. Малко след след 9 септември 1944г. е обявен за шовинистичен и повече не се отбелязва. За официален и национален празник е обявен през 1991г. с решение на Народното събрание и се отбелязва всяка година на 3 март." },
                    { 6, 7, " Българите говорят българскиТова е изненада за много чужденци. След почти пет века под управлението на Османската империя България придобива своята независимост през 1908г. Въпреки различните религии, традиции и езици на българи и османци, българският дух и език оцеляват." },
                    { 7, 7, "Българското знаме никога не е било пленявано Българската армия никога не е губил битка. За съжаление също така никога не е печелила война (поради некомпетентността на управляващите). Един от най-значимите интересни факти за България е, че по време на битка българско знаме никога не е било пленено.\r\n" },
                    { 8, 7, " България е спасила своите евреи Единствената държава в света, която е спасила своите евреи по време на Втората световна война. Въпреки факта, че страната е на страната на Германия, никой евреин никога не е бил транспортиран в концентрационен лагер." },
                    { 9, 7, "Излел е Делю Хайдутин в космоса\r\nБългарската народна песен „Излел е Делю Хайдутин“ изпълнена от българската певица на народна музика Валя Балканска беше изпратена, като музикално послание от Земята към далечния космос на борда на американската космическа сонда – Вояджър I." },
                    { 10, 7, "Най-точния календар в света\r\nПрез 1976г. ЮНЕСКО обявява прабългарския календар за най-точния в света." },
                    { 11, 7, "Първият цифров компютър в света\r\nДжон Винсент Атанасов, изобретателят на първия цифров компютър 1937г., е от български произход. Син е на българския имигрант Иван Атанасов." },
                    { 12, 7, "Най-великия борец за всички времена\r\nДан Колов е смятан от мнозина за най-великия борец за всички времена и легенда в бойните изкуства с удивителните 1500 победи и едва 72 загубени мача. Той остана горд българин до смъртта си. Негови са думите: „Чувствам се силен, защото съм българин“." },
                    { 13, 7, "Кирилицата\r\nКирилицата заменя глаголицата, която е създадена по-рано от Кирил и Методий. Климент Охридски, който е ученик на Кирил, е опростил глаголицата. Кирилицата е третата официална азбука на ЕС, откакто България се присъедини към Съюза през 2007г." },
                    { 14, 7, " България на три морета\r\nПреди да попадне под османско иго, страната ни е била двойно по-голяма. Тя е опирала на три морета – Егейско (Бяло море), Адриатическо и Черно море." },
                    { 15, 4, "Факти за българските забележителности, които ще ви оставят без дъх\r\nинтересни факти за България\r\nСкални образувания\r\nНякои от най-страхотните скални образувания в България са:" },
                    { 16, 4, " Александър Невски\r\nКатедралата Александър Невски в сърцето на българската столица е една от най –големите източноправославни катедрали в света и най голямата на Балканския полуостров." },
                    { 17, 4, "Световното наследство\r\nЮНЕСКО включи девет български обекта в списъка си с обекти на световното наследство. Някои от тях са:\r\n\r\nТракийската Казанлъшка гробница\r\nСвещарската гробница\r\nАнтичният град Несебър\r\nМадарският конник\r\nИвановски скални църкви\r\nБоянската църква\r\nРилския манастир" },
                    { 18, 4, "Предварителния списък на ЮНЕСКО\r\nПещерата Магура с рисунки от бронзовата епоха\r\nБачковският манастир\r\nГрад Мелник и Роженският манастир\r\nИнтересни факти за България и природа и територия\r\nинтересни факти за България\r\nИнтересни факти за географията на България:" },
                    { 19, 4, " Стара планина\r\nПланината, дала името на Балканския полуостров, минава през цялата ширина на България. Тя се простира от Сърбия, разделя България на Северна и Южна и достига Черно море при нос Емине.\r\n" },
                    { 20, 4, "СВЕТОВНОТО НАСЛЕДСТВО НА ЮНЕСКО\r\nНационален парк Пирин\r\nПрироден резерват Сребърна\r\n Редки животински и растителни видове" },
                    { 21, 4, "България е една от малкото страни, които могат да ви изненадат не само с красива природа, но и с редки животински и растителни видове. Някои от тях отдавна са изчезнали в други части на Европа." },
                    { 22, 4, " СПА столица на Балканите\r\nБългария е втората най-богата на природни минерални извори държава в Европа, отстъпвайки само на Исландия. Следователно България е рай за всеки любител на СПА! Тя е определена за СПА столицата на Балканите.\r\n" },
                    { 23, 4, "Производство на розово масло\r\nВ Розовата долина, разположена между планините Стара планина и Средна гора, произвежда голяма част от розовото масло в света, но все пак не е на първо място. Розовото масло е основен компонент в козметичната индустрия." },
                    { 24, 4, "Уникални пясъчни плажове на Черно море\r\nЕстествената граница на България на изток, Черно море, се отличава с девствени пясъчни плажове и високи скали. Брегът също е дом на голямо биоразнообразие и плодородната добруджанска степ." },
                    { 25, 4, " Територия\r\nС размер от почти 111 000 км 2, България е колкото Охайо, малко по-малка от съседна Гърция, някъде между размерите на Северна Корея и Южна Корея, и приблизително наполовина от Уганда." },
                    { 26, 4, "Най-високият връх на Балканите\r\nНай-високата българска планина, Рила планина, е и най-високата на Балканите. Най-високият и връх – Мусала (2925 м) е по-висок от планината Олимп със седем метра.\r\n" },
                    { 27, 8, "Кирил и Методи\r\nВече споменахме кирилицата в предишен интересен факт за България. Тъй като създаването и е имало такова огромно въздействие върху света, ще включа учените, основатели азбуката отново. Това са двамата братя св. Кирил и Методий, както и техните ученици, най-известният от които е Свети Климент Охридски." },
                    { 28, 8, "Дан Колов\r\nКогато говорим за интересни факти за България, няма как да не споменем Дан Колов и неговото постижение поне два пъти. Българинът Дан Колов е борец и боец ​​по бойни изкуства, участвал в над 1500 мача. Сред неговите постижения са спечелването на Световното първенство в тежка категория с диамантен пояс (1928, 1933), спечелването на Европейското първенство в тежка категория (1934, 1937, 1938), както и победи на турнири в Япония (1924), Бразилия (1927) и в САЩ (1914 – 1927)." },
                    { 29, 8, "Генерал Владимир Вазов\r\nТой ръководи българските сили в битка по време на Първата световна война при Дойран. Битката завърши с отблъскване на всички атаки на значително по-добре обучените, по-добре оборудвани и превъзхождащи гръцката и британската армия. Британците отдадоха голяма чест на генерал Владимир Вазов през 1936г. в Лондон, като свалиха знамената на всички свои полкове, участвали в битката. Председателят на британския легион майор Голди каза в речта си: „ Той е един от малкото чуждестранни офицери, чието име присъства в нашата история “.\r\n" },
                    { 30, 8, " Петър Петров – инженер\r\nБългарският емигрант Петър Петров е изобретател и инженер, който е работил за космическата програма на НАСА. В дългия списък с неговите постижения ще намерите развитието на една от най-ранните компютъризирани системи за наблюдение на замърсяването, телеметрични устройства за ранни метеорологични и комуникационни спътници, ранен безжичен сърдечен монитор и компонентите на един от първите цифрови часовници в света. Запомнете името му следващия път, когато погледнете часа на електронното си устройство;)" },
                    { 31, 8, "Джон Атанасов\r\nФизикът и изобретател Джон Винсент Атанасов е сочен за изобретението на първия електронен цифров компютър. Неговата машина беше наречена Atanasoff – Berry Computer." },
                    { 32, 8, "Световния рекорд на Стефка Костадинова\r\nПрез 1987г. на световното първенство в Рим тя скочи сензационните 2,09 м. Изминаха 33 години и никоя друга спортистка не е успяла подобри или постигне рекорда и." },
                    { 33, 8, "Веселин Топалов\r\nБългарският гросмайстор по шахмат Веселин Топалов е бивш световен шампион по шах." },
                    { 34, 8, "Райна Касабова\r\nБългарката Райна Касабова е първата жена в света, участвала във военен полет.\r\n" },
                    { 35, 7, "Кукерите\r\nПрез зимните месеци в села и градове в цяла България групи мъже, жени и понякога дори деца се обличат в странни за чужденците костюми, това са кукерите. Украсени с тежки камбани и огромни шапки или маски те вдигат шум за да изплашат злите духове и да денесат добра реколта." },
                    { 36, 7, " Най-големият религиозен празник\r\nДокато Коледа е най-големият празник за католическите християни, за източноправославните християни, следователно и за българите, най-големият религиозен празник е Великден.\r\n" },
                    { 37, 7, "Трифон Зарезан\r\nНа 14 Февруари -ти в света се празнува Деня на влюбените – Свети Валентин, българите празнуват и Трифон Зарезан. Той е покровител на лозарите и производителите на бяло и червено вино." },
                    { 38, 7, "Баба Марта\r\nВсяка година на 1 март ние си разменяме мартеници. Червено-белите вълнени гривни, колиета и малки фигури най-често изобразявани като Пижо и Пенда са символ на добро здраве и берекет." },
                    { 39, 7, " Нестинарство\r\nВ планинските части на България близо до границите с Турция и Гърция местните жители все още практикуват ритуал, наречен нестинарство. Мъжете и жените влизат в състояние на транс, след което ходят и танцуват върху жарава." }
                });

            migrationBuilder.InsertData(
                table: "facts",
                columns: new[] { "Id", "CategoryId", "Description" },
                values: new object[,]
                {
                    { 40, 7, "Осмото чудо на света\r\nЧували ли сте за осмото чудо на света? Така се определя и българската фолклорна музика! За да се докаже този факт, песента „Излел е Делю Хайдутин“, изпълнена от Валя Балканска, която беше описана в №9.\r\n" },
                    { 41, 7, "Именни дни\r\nЗа много българи именният ден е по-голямо тържество от рождения им ден." },
                    { 42, 7, "Чаша вода за успех\r\nКогато член на семейството напусне дома си за специално събитие, например първия учебен ден, дипломирането, важен изпит или в деня на сватбата си, останалите членове на семейството разливат вода пред прага, докато той или тя напуска и се казва „да ти върви по вода“." },
                    { 43, 7, " Да е „НЕ“, а Не е „ДА“\r\nНеобясним интересен факт за българите е, че ние въртим главите си за „да“ и кимваме за „не“, което е точно обратното на приетото в света. Не питайте защо, просто правим така!" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "facts");

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Categories",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "630d5dda-7255-4ce9-a658-0eedfb698a5f",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "a85c7e17-6d50-45a5-bd73-f05d0ef12b50", "AQAAAAEAACcQAAAAENMsNQK5BKNsVO4D4edvuzD9sZMSJFyEsDU/g2clokgYnhaw3ir1IudrHvzGaoGs8w==", "5c786e3e-685f-4242-a3c1-8d9aef56d00c" });
        }
    }
}
