using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using MyWebProject.Infrastructure.Data.Models;

namespace MyWebProject.Infrastructure.Data.Configoration
{
    public class CultureEventConfiguration : IEntityTypeConfiguration<Cultural_events>
    {
        public void Configure(EntityTypeBuilder<Cultural_events> builder)
        {
            builder.HasData(AllEvent());
        }


        private List<Cultural_events> AllEvent()
        {
            List<Cultural_events> events = new List<Cultural_events>()
            {
                new Cultural_events()
                {
                    Id= 1,
                    Name = "МЕЖДУНАРОДЕН AUTUMN JAZZ FEST",
                    Description = "Фестивалът е забележителна част от културния живот на Плевен. Неговата цел е да популяризира джаза и импровизационната музика и да ги направи по-достъпни за широката аудитория." +
                    "Създаден през 2017 година, фестивалът се провежда всяка година през месец септември на сцената в парка на Регионален исторически музей, организиран и финансиран от Община Плевен." +
                    "Във фестивалната програма са участвали знакови музиканти и групи в българския и европейски джаз, " +
                    "изпълняващи различни направления в джаза, участвали в значими джаз фестивали в България и в много престижни музикални форуми в чужбина, " +
                    "където техният атрактивен начин на представяне винаги е предизвиквал интереса и овациите на публиката.",
                    Date = "13.09.2022",
                    Hour = "17:00",
                    ImageURL = "https://visitpleven.com/wp-content/uploads/2018/02/jazz_afish_28-08-2019-2-scaled.jpg",
                    TownId= 3,
                },
                new Cultural_events()
                {
                    Id= 2,
                    Name ="Таласъмчето Тами",
                    Description ="от Магда Борисова" +
                    "nрежисьор: Ива Николова" +
                    "сценография и костюми: Константин Вълков" +
                    "композитор: Ангел Бешев" +
                    "участват: Асен Данков, Валентин Василев, Елица Анева, Камелия Хатиб, Мария Йорданова, " +
                    "Мариян Стефанов, Мариета Калъпова, Александър Кънев" +
                    "Мислите си, че е лесно да си таласъм ?" +
                    "Да поддържаш ужасяващия си вид, постоянно да си мръсен, рошав, сърдит?" +
                    "Да обитаваш мрачни места, да плашиш всички и да нямаш приятели?" +
                    "Трудно е, особено когато си малко симпатично таласъмче, което иска да бъде обичано…" +
                    "Един атрактивен, ярък и забавен спектакъл с много музика, невероятни костюми и чудесни актьори!",
                    Date = "21.11.2022",
                    Hour = "18:00",
                    TownId = 3,
                    ImageURL = "https://www.theater.bg/wp-content/uploads/2020/01/talasamcheto-tami.jpg"
                },
                new Cultural_events()
                {
                    Id = 3,
                    Name = "Един мъж и една жена",
                    Description = "Двама от най-дългогодишните и успешни актьори в плевенската трупа - Мариета Калъпова и" +
                    " Георги Ангелов ще ви потопят в една колкото забавна, толкова и тъжна история - трябва ви само ваучер!" +
                    "По Валентин Красногоров" +
                    "режисьор: Анастас Попдимитров" +
                    "сценограф: Мария Диманова" +
                    "в ролите: Мариета Калъпова и Георги Ангелов" +
                    "Една и забавна, и тъжна история, наситена с много силни емоции и топлота." +
                    "Мъж на средна възраст наема стая от една жена и се влюбва в нея. " +
                    "Уморен от скитническия живот, той иска да напусне завинаги цирка, " +
                    "в който работи от дълги години, да се ожени и да започне нов спокоен живот. Жената също е уморена да бъде сама. " +
                    "Щастието изглежда толкова близо...но дали е така? Героите решават много житейски ребуси и постоянно изненадват зрителя с ненадейни обрати.",
                    Date = "03.12.2022",
                    Hour = "19:00",
                    TownId = 3,
                    ImageURL = "https://imgrabo.com/pics/guide/20190902105930_21271.jpg"
                },
                new Cultural_events()
                {
                    Id= 4,
                    Name = "Белослава 22 ",
                    Description = "Вече 22 години творчество, а тя звучи все по-непреходно, нежно и ефирно с всеки изминал концерт. Когато става въпрос за изкуство," +
                    " времето губи значение, само играе ролята на ветропоказател за новите поколения." +
                    "С неизчерпаема любов към музиката, хората и живота, " +
                    "Белослава продължава със своето турне из България. Най-големите оперни и театрални сцени в общо 7 български града ще бъдат дом на магията, " +
                    "която Белослава създава заедно с Живко Петров," +
                    " Антони Рикев, Росен Захариев - Роко и Димитър Семов.",
                    Date = "06.12.2022",
                    Hour = "18:00",
                    TownId = 1,
                    ImageURL = "https://imgrabo.com/pics/guide/900x600/20220519140732_34740.jpeg"
                },
                new Cultural_events()
                {
                    Id = 5,
                    Name = "Ромео и Жулиета",
                    Description = "Когато трябва да кажа нещо за „Ромео и Жулиета“ си давам сметка, " +
                    "че Любовта е най-ярката и водеща отправна точка, през която гледам живота си. " +
                    "Не намирам друг смисъл и друг отговор на въпросите относно битието ни на човеци...А любовта е тази, " +
                    "която винаги ни превръща в малки, невинни, треперещи деца, които не знаят какво да правят с ударите на сърцето и пулса," +
                    " който имаме чувството, че целият свят чува как блъска кръвта в тялото ни. Ако трябва да сме честни пред света, " +
                    "ние имаме безкрайна нужда от любов, нужда, която се простира отвъд живота и достига до смъртта. Именно „Ромео и Жулиета“ " +
                    "е еманацията на това наше желание – най-щастливата трагедия в човешката култура. Да, ако трябва да сме честни, за нас е от изключително значение двамата млади веронци да умрат, " +
                    "за да имаме своя идеал за любов. Какво бихме правили, ако Ромео и Жулиета се спасят и станат, като всички нас?... Не! По неумолимия ход на Съдбата, щом искаме съвършена, " +
                    "страстна, романтична любов – тя ще умре, но ще бъде толкова красива, че ще ни прави щастливи завинаги!“" +
                    "Анастасия Събева",
                     Date = "19.12.2022",
                     Hour = "18:30",
                     TownId = 1,
                     ImageURL = "https://cdn.artvibe.co/images/i/m1aaaaaaaaaaaaaaaaaaaaaaaaaaa252.jpg?s=xl"
                },
                new Cultural_events()
                {
                    Id = 6,
                    Name = "Хензел и Гретел",
                    Description = "Автор: Братя Грим,Драматизация: Теодора Георгиева" +
                    "Режисьор: Александра Петрова,Сценография: Десислава Банкова" +
                    "Музика: Дони - Добрин ВекиловПластика: Антоанета Добрева – Нети" +
                    "Видео и мултимедия: Петко Танчев" +
                    "Фотограф: Гергана Дамянова" +
                    "Помощник-режисьор: Емилия Георгиева" +
                    "Участват: Александър Хаджиангелов, Рая Пеева, Красимир Недев, Кристина Янева, Севар Иванов, Светослав Добрев" +
                    "Любимата на всички деца приказка на Братя Грим оживява на сцената на Младежки театър. Освен досетливите и добри деца Хензел и Гретел, " +
                    "тук може да срещнете и нови приказни герои - техните приятели Елф и Гарван, както и Джиндифиловата вещица." +
                    "Когато Хензел и Гретел се озовават в непознатата и тъмна гора, те трябва сами да се справят и да намерят пътя към дома. " +
                    "Там срещат Джинджифиловата вещица, която не им мисли доброто.И въпреки, че добрият Елф тайно ги пази, на финала те осъзнават, че това което им помага е надеждата и вярата в собствените им сили. „ Малките герои побеждават своите врагове. " +
                    "Големите герои побеждават себе си!”" +
                    " си казват те и продължават напред.",
                    Date = "20.12.2022",
                    Hour = "17:00",
                    TownId = 1,
                    ImageURL = "https://theatre.peakview.bg/img/photos/BIG15117195521Hansel_Gretel_Damianova_8_web.jpg"
                },
                new Cultural_events
                {
                    Id = 7,
                    Name = "Еxclusive Actors Night",
                    Description = "Участие ще вземат едни от най-актуалните и обичани български артисти - Аня Пенчева, " +
                    "Мария Сапунджиева, Иво Аръков, Кирил Ефремов, Руслан Мъйнов, " +
                    "Ненчо Илчев, Албена Михова, Евгени Будинов и неповторимият Мариус Куркински, " +
                    "който в първите дни след обявяване на събитието бе гост-загадка на самия афиш. " +
                    "Ексклузивната актьорска вечер няма как да мине и без музикален съпровод, но изпълнителите за сега остават в загадка и" +
                    " ще се обявяват поетапно.В звездната актьорска вечер ще има много песни, модерно озвучаване и красиво осветление... " +
                    "и още...",
                    Date = "19.11.2022",
                    Hour = "19:00",
                    TownId = 2,
                    ImageURL = "https://eportal.bg/assets/stagings/large/r_6253f844cf18c_d4192ae7f46cf.jpg"
                },
                new Cultural_events()
                {
                    Id = 8,
                    Name = "Grafa Live",
                    Description = "Концерт на живо С последните хитове на  Grafa.",
                    Date = "25.22.2022",
                    Hour = "20:00",
                    TownId= 2,
                    ImageURL = "https://imgrabo.com/pics/guide/900x600/20220817094312_30940.jpeg"
                },
                new Cultural_events()
                {
                    Id = 9,
                    Name = "Приказната Пепеляшка",
                    Description = "Образователен спектакъл за най-малките! Въведете ги в света на операта - " +
                    "с приказна история с музика на Росини!" +
                    "Подходящ за деца от 3 години до 10 години и техните родители." +
                    "Продължителност: 55 минути." +
                    "Постановка - Симоне Гуера" +
                    "Режисьор - Матео Молианези" +
                    "nКукли - Илариа Комисо" +
                    "Превод - Момчил Караиванов" +
                    "Солисти и артисти - Светлана Иванова, Елин Стоянова, Ивелин Николов, Цветомира Цонева",
                    Date = "20.11.2022",
                    Hour = "11:00",
                    TownId = 2,
                    ImageURL = "https://www.cross.bg/photo_new_gallery/2022/02/24/50ad63c9052e28a7f609922b44ef9609.jpg"
                },
                new Cultural_events()
                {
                    Id = 10,
                    Name = "Пинокио",
                    Description = "По Карло Колоди" +
                    "Драматизация Рада Москова" +
                    "Постановка и сценична среда - проф. Андрей Аврамов" +
                    "Музикално ръководство - Евгени Господинов" +
                    "Участват:" +
                    "Георги Ножделов, Цветомир Черкезов, Стефан Борисов, Жоро Райчев, Миленка Сотирова, Илина Илиева" +
                    "Мили деца," +
                    "Италианският писател Карло Колоди е написал историята за дървената кукла Пинокио много отдавна - през 1883г." +
                    "По тази приказка е създадена пиеса, която вашите родители са гледали, когато са били на вашата възраст." +
                    " Годините минават, децата порастват, стават майки и бащи, " +
                    "а историята за дървеното човече, което иска да стане истинско момче, продължава да се играе по цял свят. И така вече цели 135 години! Когато и вие станете майки и татковци, доведете децата си на това представление - " +
                    "Пинокио пак ще бъде тук, бъдете сигурни!",
                    Date = "01.12.2022",
                    Hour = "11:00",
                    TownId = 4,
                    ImageURL = "https://imgrabo.com/pics/guide/900x600/20220324110331_98213.jpeg"
                },
                new Cultural_events()
                {
                    Id = 11,
                    Name = "Жабокът принц (куклен театър)",
                    Description =
                    "по Братя Грим" +
                    "Драматизация: Веселин Бойдев" +
                    "Текст на песните: Славчо Маленов" +
                    "Режисьор: Дарин Петков" +
                    "Сценография: Диана Узунова" +
                    "Музика: Гергана Василева" +
                    "Актьорски състав: Биляна Райнова, " +
                    "Елица Стоянова, Кирил Антонов, Латина Беровска, Татяна Андреева, Янчо Иванов" +
                    "Приказка за една малка принцеса и …ЖАБОК!" +
                    "Чрез веселите и необичайни ситуации, създадени от омагьосания Жабок, разбираме че," +
                    " когато човек може да понесе отговорността на думите и обещанията си, тогава е готов да срещне и да познае " +
                    "истинската любов.",
                    Date = "25.11.2022",
                    Hour = "12:00",
                    TownId = 4,
                    ImageURL = "http://theatre.art.bg/img/photos/BIG14008272153zabokyt-princ%20(1).jpg"
                },
                new Cultural_events()
                {
                    Id = 12,
                    Name = "Балетният спектакъл Лебедово езеро",
                    Description = "Постановка и режисура Силвия Томова" +
                    "по хореографията на Мариус Петипа, Лев Иванов, Анастас Петров и Калина Богоева – редакция Силвия Томова /2017/" +
                    "Диригент Ивайло Кринчев" +
                    "Художник декори и костюми Денис Иванов" +
                    "Консултант, изпълнител Първолета Чавдарова-Летиция" +
                    "Солисти и кордебалет на Държавна Опера-Стара Загора" +
                    "Оркестър на Държавна опера Стара Загора" +
                    "Детско-юношеска студия за опера и балет на Държавна опера-Стара Загора",
                    Date = "16.12.2022",
                    Hour = "19:00",
                    TownId = 4,
                    ImageURL = "https://static.bnr.bg/gallery/cf/cfafa1b78abda178ee7efd33dfd8491c.jpeg"
                },
                new Cultural_events()
                {
                    Id = 13,
                    Name = "Усещане за любов",
                    Description = "музикално-поетичен спектакъл" +
                    "Режисьор: Бойка Велкова" +
                    "Музикална среда и музика: Теодосий Спасов" +
                    "Хореография: Татяна Соколова" +
                    "Визуална среда: Яна Дворецка" +
                    "С: Бойка Велкова, Ивайло Захариев" +
                    "Спектакълът представлява обяснение в любов към музиката, танца, поезията и театърът на Европа. " +
                    "Включва избрани любовни поеми от най-големите европейски писатели, поети и мислители, " +
                    "символични за своята нация и епоха.",
                    Date = "17.12.2022",
                    Hour = "19:00",
                    TownId = 5,
                    ImageURL = "https://theatre.peakview.bg/theatre/photos/BIG1569442896170385680_2698892923462698_1534574836855078912_n.jpg"
                },
                new Cultural_events()
                {
                    Id = 14,
                    Name = "Тоника СВ Live",
                    Description = "Спектакълът се очертава като едно от големите музикални събития през новия творчески сезон във Варна." +
                    " Не пропускайте да се насладите на хитовете на легендарната група." +
                    "Тоника СВ от години е сред най-обичаните и слушани български групи," +
                    " а песните им до една са се превърнали в шлагери - Здравей, как си приятелю," +
                    "Един неразделен клас, Моя любов, Нека да е лято, Винаги двама и редица други." +
                    "Организаторите загатват, че на концерта има голяма вероятност да чуем и съвсем нови песни на групата - " +
                    "първите такива от близо 20 години насам.",
                    Date = "19.12.2022",
                    Hour = "20:00",
                    TownId = 5,
                    ImageURL = "https://imgrabo.com/pics/guide/900x600/20221006134600_14286.jpeg"
                },
                new Cultural_events()
                {
                    Id = 15,
                    Name = "Магазин за приказки",
                    Description = "Един моноспектакъл за чудесата, свободата, пътешествията, " +
                    "приятелите и вълшебствата, които са край нас!" +
                    " С приключенката" +
                    " Тарантела ще обиколите детския свят и ще преживеете фантастични истории, " +
                    "които няма къде другаде да чуете.",
                    Date = "06.12.2022",
                    Hour = "12:00",
                    TownId = 5,
                    ImageURL = "http://static.bnr.bg/gallery/cr/23af6bd8a21f89f949b1732522b82242.jpg"
                }

            };
            return events;
        }
    }
}
