using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using MyWebProject.Infrastructure.Data.Models;

namespace MyWebProject.Infrastructure.Data.Configoration
{
    public class JourneyConfiguration : IEntityTypeConfiguration<Journeys>
    {
        public void Configure(EntityTypeBuilder<Journeys> builder)
        {
            builder.HasData(Alljourneys());
        }

        private List<Journeys> Alljourneys()
        {
            List<Journeys> journeys = new List<Journeys>()
            {
                new Journeys
                {
                    Id = 1,
                    Name = "Двудневна екскурзия до Връх Чиляка",
                    Description = "Древното светилище край село Небеска е изпълнено с невероятни скални форми, изветряни в продължение на " +
                    "милиони години, " +
                    "изобилие от трапецовидни ниши и скални кухини, вероятно използвани като погребални съоръжения." +
                    "Скални гъби, фигури на животни, човешки лица, змийски и птичи глави може да открие човек, гледайки скалите." +
                    "От района на Женда и Небеска преминаваме по един от най-красивите родопски пътища, извиващ се покрай " +
                    "язовирите Боровица и Кърджали. Спираме за снимка на сводестия каменен мост на Ненково." +
                    "Мостът е внушителен с размерите си, има 5 свода и е заобиколен от магнетична природа. " +
                    "Преходът за деня е с обща продължителност около 4 часа." +
                    "Нощувка. " +
                    "2-ри ден: " +
                    "Отправяме се към язовир Боровица и село Безводно. Безводно е едно от най-красивите села" +
                    "в Родопите, разкриващо живописна панорама към заобикалящите го вулканични скали и върхове." +
                    "Маршрутът ни отвежда към връх Чиляка (1459 м) - най-високият връх в рида Каракулас." +
                    "Пътят до него минава през изключително красив ландшафт, сред редуващи се гори и голи чукари." +
                    "Районът е осеян с високи канари и мегалити от времето на траките. Гледките към язовирите Кърджали и Боровица," +
                    " както и към река Арда, са незабравими.",
                    Rating = 7.2m,
                    StartDate = "05-08-2023",
                    Day = 2,
                    Price = 115
                },
                new Journeys
                {
                    Id = 2,
                    Name = "Двудневна екскурзия на Кръстовден до Кръстова гора и Бачковски манастир",
                    Description = "Отпътуване на 13 септември от София, Автогара Сердика в 07:30 ч., " +
                    "от ОМВ на бул. Цариградско шосе, Младост 1 в 07:40 ч., от Пловдив, бензиностанция OMV пред хотел Санкт Петербург в 09:30 ч. за Кръстова гора." +
                    "Пристигане в Кръстова гора. За обяд и вечеря си носете суха храна." +
                    "В Средните Родопи, сред красива природа се намира манастирът “Св. Троица” – Кръстова гора, " +
                    "или както се отбелязва в картата на България, Кръстов връх. " +
                    "През последните години сред православните християни в България манастирът придоби широка известност, " +
                    "като християнска светиня и място за поклонение. Тази местност висока 1545 м. над морското ниво, дълга около 500 м и широка около 300 м, е кръгла поляна заобиколена от гъсти букови гори. " +
                    "Оттук панорамната гледка е смайваща, в далечината се вижда море от планински ридове и върхове." +
                    "nВ 00:00 ч. започва тържествената празнична литургия за Кръстовден - празникът на манастира, която продължава до 03:00 ч. Свободно време за почивка сред природата в района на манастира." +
                    "Масовото религиозно събиране се случва веднъж годишно - в нощта на 13 срещу 14 септември (Кръстовден). " +
                    "Хиляди вярващи се събират на хълма за нощната литургия в очакване на чудо. Бдението завършва с изгрева на слънцето, когато лъчите му докоснат върха на големия метален кръст." +
                    " Православният поклоннически комплекс днес има две църкви и 15 параклиса, " +
                    "които са разположени от двете страни на пътеката към кръста." +
                    "Сутринта на 14 септември отпътуване за Бачковски манастир, основан през XI век. Изиграл важна роля през годините, днес Бачковският манастир е втория по големина и значимост в България." +
                    " Разполага с три църкви.",
                    Rating = 10m,
                    Day = 2,
                    StartDate = "13-09-2023",
                    Price = 59
                },
                new Journeys
                {
                    Id = 3,
                    Name = "Двудневна екскурзия до Перперикон, Татул, Кърджали, Каменни гъби  от София и Пловдив",
                    Description = "1 ден:" +
                    "Тръгване в 07:00 ч. от София, централна ЖП гара; 07:10 ч. - ОМВ на бул. Цариградско шосе, Младост 1; " +
                    "от Пловдив в 09:00 ч. Пътува се в посока Кърджали." +
                    "Фотопауза при уникалния скален феномен Каменните гъби при село Бели Пласт. " +
                    "В близост сенамира и една от най-големите в света кариери за добиване на зеолит с изключително качество." +
                    "Посещение на свещения град Перперикон - един от най-значимите археологически обекти в европейски " +
                    "и световен мащаб с местен екскурзовод. Археологическият комплекс включва голямо мегалитно светилище " +
                    "от преди 8000 години, паметници от античността и средновековна крепост. Ежегодните разкопки и проучвания" +
                    "разкриват нови и нови следи от всички епохи - при траките Перперикон е свещен скален град" +
                    "Посещение на Историческия музей в Кърджали. Проектант на сградата е големият руски архитект" +
                    "проф. Александър Померанцев. Експозицията на музея представя историята и природните богатства на" +
                    "Източните Родопи - „Археология и история“, „Етнография“ и „Минералология и Природа“, на 1800 кв.м в 30 зали." +
                    "Посещение на манастирския комплекс Успение Богородично - уникално духовно средище," +
                    "реставрирано и достроено от отец Боян Саръев - райски кът и оазис на вярата в този край, привличащ" +
                    "хора от цялата страна. Частиците от Кръста Господен, намерени до Перперикон, се съхраняват тук." +
                    "Посещение на средновековния манастирски комплекс от VI-VII в. „Св. Йоан Продром“ - един от най-" +
                    "забележителните храмове в цяла България с изключителната си история, ценни стари стенописи и уникални находки. ",
                    Rating = 9.5m,
                    Day = 1,
                    StartDate = "24-06-2023",
                    Price = 129
                },
                new Journeys
                {
                    Id = 4,
                    Name = "Белоградчишките скали, пещерата Магура, пещерата Венеца и Видин от Пловдив",
                    Description = "1 ден: Отпътуване от Пловдив в 7:00 ч. от спирката на ОББ срещу Тримонциум, по маршрут: София – " +
                    " Белоградчик – Видин.   Пристигане  и посещение на пещерата  Венеца. " +
                    "Почивка за обяд и възможност за дегустация на северняшки – ТУРЛАШКИ  – специалитети в хан Мадона. " +
                    "Разглеждане на парка и комплекса към него. Отпътуване за Белоградчик. Пристигане и посещение на Белоградчишките скали, " +
                    "които са включени в списъка на 100-те национални туристически обекта на България със своите красиви скални фигури, " +
                    "достигащи на места до 200 метра височина и разделени на 3 основни групи. Изключително преживяване с незабравими, " +
                    "спиращи дъха природни гледки сред скали с причудливи форми и гигантски пещери. " +
                    " Възможност за организирана вечеря. Нощувка." +
                    "2 ден: Закуска. Туристическа разходка в центъра на града с екскурзовод. " +
                    "Град Видин изгражда своя облик в продължение на две хилядолетия, поради това е сложна смесица от различни исторически епохи. Посещение на най-известната забележителност на старопрестолния град, " +
                    "средновековната крепост Баба Вида – единствената изцяло запазена в страната /Х век/,  " +
                    "Кръстата казарма, Турският конак, където сега се помещава градския Исторически музей, " +
                    "Джамията и библиотеката на Осман Пазвантоглу, старата турска поща,художествената галерия," +
                    "Видинския общински театър, митрополитския комплекс, църквата” Великомъченик Димитрий”, " +
                    "Еврейската Синагога, построена през 1894 г. Свободно време за обяд и  разходка в Крайдунавския парк, ",
                    Rating = 8.9m,
                    Day = 2,
                    StartDate = "06-17-2023",
                    Price = 119
                },
                new Journeys
                {
                    Id = 5,
                    Name = "Екскурзия до Мелник и Рупите с посещение на Рилски и Роженски манастир от Пловдив",
                    Description = "1-ви ден:" +
                    "Възможност за отпътуване от Карлово – срещу доплащане от 10 лв. за двете посоки. Отпътуване от гр. Пловдив в 07:00ч. от спирката на „Тримонциум”. Пристигане в Самоков. Посещение на Девическия манастир, Бельовата църква " +
                    "”Рождество Богородично”, Голямата чешма (чешмата с обицата). Отпътуване за  Рилски манастир „Успение Пресвета Богородица” " +
                    " най – внушителният паметник на българската архитектура и най – големият духовен център по българските земи (престой около 3 часа за разглеждане на манастира)." +
                    " По брега на Рилската река ще се насладите на зеленина, шум на река, мирис на гора, ще имате възможност за кратка почивка и обяд в някое от китните ресторантчета.  Иван Рилски. " +
                    "Отпътуване за Сандански. Разходка в града и време за почивка. Отпътуване за Мелник. " +
                    "Настаняване в хотела. Нощувка. По желание – организирана вечеря." +
                    "2-ри ден:" +
                    "Закуска. В 9.30ч. обзорна разходка в гр. Мелник с екскурзовод. Посещение на Кордопуловата къща. Тя е най-голямата възрожденска къща на Балканския полуостров, построена през 1754г." +
                    " В приземния етаж на къщата има вкопани изби за вино, в тях се е произвеждало и съхранявало прочутото мелнишко вино. Впечатляваща е вътрешната архитектура на къщата с украси от стенописи, резби и стъклописи." +
                    "Посещение на Роженски манастир в близост до Мелник, където се намира най-известната манастирска Чудотворна икона." +
                    "Отпътуване за Рупите и  църквата „Света Петка Българска“, в близост до къщичката, в която е живяла Ванга. " +
                    "Местността около Рупите е много живописна, тук се намира планината Кожух, която е резултат от изригнал вулкан. " +
                    "които са включени в червената книга на България. Към 16.00ч.отпътуване за Пловдив.",
                    Rating = 6.9m,
                    Day = 2,
                    StartDate = "10-28-2023",
                    Price = 120
                },
                new Journeys
                {
                    Id = 6,
                    Name = "Eкскурзия до Плевен, Ловеч и Тетевен с посещение на пещера Съева дупка",
                    Description = "Панорама Плевенска епопея 1877 г. е единствен по рода си паметник на Балканския полуостров. " +
                    "Изграден е през 1977 г. по повод 100-годишнината от освобождението на Плевен от османско владичество. " +
                    "Паметникът се издига на самото бойно поле, в Скобелевия парк-музей в югозападните покрайнини на града." +
                    " Освобождението на Плевен е преломен момент в хода на Руско-турската война от 1877-1878 г." +
                    "Посещение на Мавзолея-параклис Свети Георги Победоносец." +
                    "Закуска. Отпътуване за пещера Съева дупка – считана за една от най-красивите пещери на България. " +
                    "В пещерата се срещат сталагмити, сталактити, сталактони, дендрити и хеликтити, като най-големият сталактит в нея има обиколка от 60 метра. " +
                    "Дълга е 205 метра и има средна температура 7-11 градуса. На около 70 метра под земята в пещерата тече река, за която се смята, че е на 3 млн години. Свободно време за разглеждане с екскурзовод." +
                    "Отпътуване за Тетевен, разположен живописно по течението на река  Бели Вит, " +
                    "сгушен в полите на живописния Тетевенски балкан. Тетевен е един от 100-те Национални туристически обекта заради Историческия си музей. Той е създаден през 1932 г. " +
                    "по инициатива на местното население, което искало да почете паметта на загиналите за свободата на народа си съграждани. Разходка до църквата Всях Светих - уникална за времето си с внушителни размери. " +
                    "Разглеждане отвън на манастира Св. Илия, " +
                    "оцелял при цялостното опожаряване на Тетевен от турците през 1779 г. Свободно време за обяд и разходка в центъра на града." +
                    "Следва пешеходен преход по екопътека „Под пръските на водопада“ и посещение на водопад Скока. Екопътеката започва от центъра на гр.",
                    Rating = 9.1m,
                    Day= 2,
                    StartDate ="30-09-2023",
                    Price = 119
                },
                new Journeys
                {
                    Id = 7,
                    Name = "Двудневна екскурзия до Каньона на Арда и Българският Стоунхендж",
                    Description = "1 ден:"+
                    "Tръгване 7:10 ч. ОМВ на бул. Цариградско шосе,  " +
                    "Младост 1, от Пловдив в 9:00 ч.  -  ОМВ пред хотел Санкт Петербург." +
                    "Пътуване към Кромлеха до с. Долни Главанак - примитивен каменен календар от 6-8 в. пр.Хр.," +
                    "състоящ се от няколко вертикални пирамидално оформени каменни блокове, описващи окръжност с диаметър 10 метра. " +
                    "Това сакрално пространство, отделено от външния свят, е било място на свещенодействията на жреците." +
                    "Негов мегалитен аналог е световно известният британски Стоунхендж. Преход по екопътека около 1 км, около 15 минути в едната посока." +
                    "Спирка при Големия завой на Арда - един от най-красивите меандри на р.Арда. Намиращ се в близост до с.Бориславци, " +
                    "освен най-впечатляващ, той е и един от най-достъпните завой на Арда." +
                    "Закуска :един от най- големите мегалитни култови комплекси в Източните Родопи." +
                    "По пътя наблюдение на част от многобройните мегалитни съоръжения." +
                    "Целият район представлява голяма територия от резервати, защитени местности и скални природни феномени –  " +
                    "Кован кая, Хамбар кая, Карталкая . В отвесните скали на вулканичните масиви‚ на шеметна височина‚ " +
                    "са изсечени повече от 100 трапецовидни ниши. Освен нишите, в скалите има гробници и други култови съоръжения." +
                    "Над цялата територия се извисява Голямата Арка." +
                    "Отпътуване към най-големия мост на р.Арда, от където се разкрива живописна гледка." +
                    "Посещение на язовирната стена на яз. Студен кладенец. Под нея намира най-изумителната част от каньона на р. Арда - Шейтана.",
                    Rating = 9.9m,
                    Day = 2,
                    StartDate ="13-05-2023",
                    Price = 128
                }
            };

            return journeys;
        }
    }
}
